// Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.
#include <iostream>

int main() {
    std::cout << "7" << "  " << "15" << "  " << "100" << std::endl;
    return 0;
}
