//Составить программу вывода на экран в одну строку четырех любых чисел с одним пробелом между ними.
#include <iostream>

int main() {
    std::cout << 10 << " " << 20 << " " << 30 << " " << 40 << std::endl;
    return 0;
}
